# библиотека для работы с ip-адресами
from ipaddress import *

# Конвертирует текст в объект ip_address
ip = ip_address('192.0.0.5')

# Формирует все ip-адреса по заданной маске и сети
net = ip_network('192.0.0.5/255.255.255.254', False)

# количество ip-адресов в текущей сети
num_addresses = net.num_addresses

# Широковещательный.  Не может быть задан для устройства
broadcast_address = net.broadcast_address
#  Адрес сети.  Не может быть задан для устройства
network_address = net.network_address

# список всех хостов / узлов / ip-адресов для устройств
hosts = net.hosts()

# возвращает маску сети
mask = net.netmask

# Варианты значений в маске
#    255  .   255  .    A   .   0
# 11111111.11111111.00000000.00000000 -> A = 0
# 11111111.11111111.10000000.00000000 -> A = 128
# 11111111.11111111.11000000.00000000 -> A = 192
# 11111111.11111111.11100000.00000000 -> A = 224
# 11111111.11111111.11110000.00000000 -> A = 240
# 11111111.11111111.11111000.00000000 -> A = 248
# 11111111.11111111.11111100.00000000 -> A = 252
# 11111111.11111111.11111110.00000000 -> A = 254
# 11111111.11111111.11111111.00000000 -> A = 255

